testdata/IN_2023_02/Roundtrip/produkt/alltagsfaehigkeit/dzh/dzh_12sicher_aktiv_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getQuote xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dol="urn:de:vb:bipro:taa:dol:1.12" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vbl="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        
      <tarif:Request>
            
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
            
        <tarif:Tarifierung>
                
          <tarif:Partner xsi:type="partner:CT_Person">
                    
            <partner:Anrede>1</partner:Anrede>
                    
            <partner:PartnerID>1</partner:PartnerID>
                    
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
                    
            <partner:Geschlecht>1</partner:Geschlecht>
                  
          </tarif:Partner>
                
          <tarif:Verkaufsprodukt>
                    
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                        
              <pm:Versicherungsdauer>
                            
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                 
          
              </pm:Versicherungsdauer>
                        
              <pm:Kennung>DZH</pm:Kennung>
                        
              <pm:Elementarprodukt xsi:type="pm-leben:CT_PflegeAbsicherung">
                              
                <basis:Erweiterung xsi:type="dol:CT_GrundfaehigkeitAbsicherung">
                                    
                  <dol:Beitragsplan>false</dol:Beitragsplan>
                                
                </basis:Erweiterung>
                              
                <vs-pm:VersicherungssummeOderLeistung>
                                  
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                                  
                  <vs-pm:Wert>500</vs-pm:Wert>
                                  
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                  
                  <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                                
                </vs-pm:VersicherungssummeOderLeistung>
                              
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                              
                <pm-leben:VersichertePerson>
                                    
                  <partner:PartnerID>1</partner:PartnerID>
                                
                </pm-leben:VersichertePerson>
                          
              </pm:Elementarprodukt>
                        
              <pm:Elementarprodukt xsi:type="pm-leben:CT_PflegeAbsicherung">
                              
                <basis:Erweiterung xsi:type="dol:CT_GrundfaehigkeitAbsicherung">
                                  
                  <dol:Baustein12Sicher>true</dol:Baustein12Sicher>
                                
                </basis:Erweiterung>
                              
                <pm-leben:IstHauptversicherung>false</pm-leben:IstHauptversicherung>
                              
                <pm-leben:VersichertePerson>
                                    
                  <partner:PartnerID>1</partner:PartnerID>
                                
                </pm-leben:VersichertePerson>
                          
              </pm:Elementarprodukt>
                         
              <pm-leben:VorgabeBerechnung>
                              
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">GarantierteRente</pm-leben:ArtID>
                              
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">PflegeAbsicherung</pm-leben:Kontext>
                           
              </pm-leben:VorgabeBerechnung>
                      
            </pm:Produkt>
                  
          </tarif:Verkaufsprodukt>
              
        </tarif:Tarifierung>
          
      </tarif:Request>
      
    </tarif:getQuote>
  </soapenv:Body>
</soapenv:Envelope>
